[
    {
        "title": "1st Year College",
        "company": "• Holy Angel University",
        "date": "S.Y. 2021-2022",
        "description": "This is my first time I get to experience programming. Starting with C++, where I learned the basics such as input and output operations, basic mathematical functions, and conditional statements like if and else. In addition to programming, I worked extensively with AutoCAD, creating detailed 2D floor plans of various sizes and layouts. For my 3D projects in AutoCAD, I successfully designed digital models of fundamental parts such as frames and casings. These experiences have provided me with a solid foundation, providing me the skills and knowledge that I constantly apply up to this day. It applies both programming and digital design, which enhances my problem-solving skills and technical proficiency.",
        "skills": [
         "C++",
         "AutoCAD"
        ]
    },
    {
        "title": "2nd Year College",
        "company": "• Holy Angel University",
        "date": "S.Y. 2022-2023",
        "description": "This is where my experience with web development has came to a start. I got introduced to basic html and css, and this is where I got exposed to full-stack development for the first time.  We are tasked to create a full-stack project using python and Django REST framework as our backend. This is where I also got study about electronics, what are the various components, what they do, and how they should be applied. Though it is more on a textbook approach I have yet to experience handling electronics later on. Throughout the 2nd semester of this school year, we are tasked to study React.js and this is where my interest to front-end design has started. ",
        "skills": [
            "HTML",
            "CSS",
            "Python",
            "ReactJS",
            "Django"
        ]
    },
    {
        "title": "3rd Year College",
        "company": "• Holy Angel University",
        "date": "S.Y. 2023-2024",
        "description": "Throughout the first semester of this school year, we were tasked with creating a tourism website, and by the end of the project, we'll have to present it to the local government of the designated place of our website. We mostly focused on the front-end aspect of web development, specifically using only HTML and CSS. We were given an individual task as well to create an about me website using those two languages mentioned earlier, though there is some JavaScript involved for the animations. This is the school year that I also got exposed to Arduino, we started to use different types of sensors, and components and got to write and upload code to our module using the Arduino IDE.",
        "skills": [
            "HTML",
            "CSS",
            "JavaScript",
            "Arduino",
            "C++"
        ]
    },

    {
        "title": "4th Year College",
        "company": "• Holy Angel University",
        "date": "2024-2025",
        "description": "As of this very moment, I am working on personal projects, studying programming languages, and diving deeper into technology. My fascination with electronics started with the ESP32 Marauder project, where I successfully ported and flashed firmware to an ESP32 development board. This experience fueled my interest in exploring various microcontrollers and development boards. Currently, I'm also focused on learning more about AI, specifically through tools like Gemini AI, various API inferences, and also local models from Ollama. I'm always invested in learning all things about tech and applying them in the very projects I will work on in the future.",
        "skills": [
            "NextJS",
            "Gemini AI",
            "Ollama",
            "Firebase",
            "Tailwind CSS",
            "ESP32",
            "C++"
        ]
    }
]
